icoFoam_fluidic_pinball/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            zeroGradient;
    }
    cylinder_a
    {
        type            zeroGradient;
    }
	cylinder_b
    {
        type            zeroGradient;
    }
	cylinder_c
    {
        type            zeroGradient;
    }
	outlet
    {
        type            fixedValue;
		value			uniform 0;
    }
	
    front
    {
        type            empty;
    }
	back
    {
        type            empty;
    }
}


// ************************************************************************* //