icoFoam_fluidic_pinball/0/vorticity
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2312                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volVectorField;
    location    "0";
    object      vorticity;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   nonuniform List<vector> 
52950
(
(0 -0 0)
(0 -0 0)
(0 -0 0)
(0 -0 0)
(0 -0 0)
(0 -0 0)
(0 -0 0)
(0 -0 0)
...
)
;

boundaryField
{
    cylinder_a
    {
        type            calculated;
        value           nonuniform List<vector> 
137
(
(0 -0 -0.711352)
(3.83195e-17 -4.41571e-17 -0.581783)
(8.47095e-17 -9.84404e-17 -0.420138)
(0 -0 -0.220138)
(0 -0 0.0247934)
(1.16504e-16 -1.35965e-16 0.320828)
(1.29621e-16 -1.50544e-16 0.672616)
(0 -0 1.08163)
...
)
;
    }
    cylinder_b
    {
        type            calculated;
        value           nonuniform List<vector> 
100
(
(0 -0 -64.1727)
(-3.43952e-16 -1.53264e-16 -71.0406)
(0 -0 -78.5808)
(0 -0 -86.7814)
(1.74088e-15 8.813e-16 -95.5742)
(1.87915e-15 9.91085e-16 -104.808)
(0 -0 -114.219)
(0 -0 -123.407)
...
)
;
    }
    cylinder_c
    {
        type            calculated;
        value           nonuniform List<vector> 
137
(
(0 -0 -71.4705)
(0 -0 -80.7309)
(-4.34903e-16 2.43846e-15 -90.1321)
(0 -0 -99.2967)
(0 -0 -107.734)
(0 -0 -114.878)
(0 -0 -120.156)
(0 -0 -123.096)
...
)
;
    }
    inlet
    {
        type            calculated;
        value           nonuniform List<vector> 
600
(
(0 -0 10.3714)
(0 -0 10.0984)
(0 -0 9.85089)
(0 -0 9.62582)
(0 -0 9.42046)
(0 -0 9.23253)
(0 -0 9.06009)
(0 -0 8.90146)
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<vector> 
224
(
(0 -0 0)
(0 -0 0)
(0 -0 0)
(0 -0 0)
(0 -0 0)
(0 -0 0)
(0 -0 0)
(0 -0 0)
...
)
;
    }
    back
    {
        type            empty;
    }
    front
    {
        type            empty;
    }
}


// ************************************************************************* //
