icoFoam_fluidic_pinball/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2312                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

7
(
    cylinder_a
    {
        type            wall;
        inGroups        1(wall);
        nFaces          137;
        startFace       105301;
    }
    cylinder_b
    {
        type            wall;
        inGroups        1(wall);
        nFaces          100;
        startFace       105438;
    }
    cylinder_c
    {
        type            wall;
        inGroups        1(wall);
        nFaces          137;
        startFace       105538;
    }
    inlet
    {
        type            patch;
        inGroups        1(freestream);
        nFaces          600;
        startFace       105675;
    }
    outlet
    {
        type            patch;
        inGroups        1(freestream);
        nFaces          224;
        startFace       106275;
    }
    back
    {
        type            empty;
        inGroups        1(empty);
        nFaces          52950;
        startFace       106499;
    }
    front
    {
        type            empty;
        inGroups        1(empty);
        nFaces          52950;
        startFace       159449;
    }
)

// ************************************************************************* //
