icoFoam_fluidic_pinball/system/controlDict
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
    version 2.0;
    format ascii;
    class dictionary;
    object controlDict;
}

application icoFoam;

startFrom startTime;
startTime 0;
stopAt endTime;
endTime 100;
deltaT 0.005;
adjustTimeStep yes;
maxCo 1;

writeControl timeStep;
writeInterval 100;
purgeWrite 0;
writeFormat ascii;
writePrecision 6;
writeCompression no;
timeFormat general;
timePrecision 6;
runTimeModifiable yes;

functions
{
    forces_cylinder_a
    {
        type forces;
        libs ("libforces.so");
        writeControl timeStep;
        writeInterval 1;
        patches ("cylinder_a");
        rho rhoInf;
        rhoInf 1;
        CofR (-1.299 0 0);
        dragDir (1 0 0);
        liftDir (0 1 0);
        pitchAxis (0 0 1);
        magUInf 1;
        lRef 1;
        Aref 1;
        log true;
    }

    forces_cylinder_b
    {
        type forces;
        libs ("libforces.so");
        writeControl timeStep;
        writeInterval 1;
        patches ("cylinder_b");
        rho rhoInf;
        rhoInf 1;
        CofR (0 0.75 0);
        dragDir (1 0 0);
        liftDir (0 1 0);
        pitchAxis (0 0 1);
        magUInf 1;
        lRef 1;
        Aref 1;
        log true;
    }

    forces_cylinder_c
    {
        type forces;
        libs ("libforces.so");
        writeControl timeStep;
        writeInterval 1;
        patches ("cylinder_c");
        rho rhoInf;
        rhoInf 1;
        CofR (0 -0.75 0);
        dragDir (1 0 0);
        liftDir (0 1 0);
        pitchAxis (0 0 1);
        magUInf 1;
        lRef 1;
        Aref 1;
        log true;
    }
	
}


